[
  {
  "title": "Subset - Random Subset REST API",
  "year": 2024,
  "image": "https://vis-society.github.io/labs/2/images/empty.svg",
  "description": "A REST API microservice for random dataset subset generation with multiple database connectors and local serialization system. Part of a larger machine learning infrastructure project. Built using FastAPI and supporting both SQL and NoSQL databases."
  },
  {
  "title": "PokeID - Trading Card Identifier",
  "year": 2024,
  "image": "https://vis-society.github.io/labs/2/images/empty.svg",
  "description": "CNN-based system for identifying original Pokemon trading cards, featuring custom data pipeline, web scraping, and image processing tools built with Keras. Includes comprehensive data labeling and batch processing capabilities."
  },
  {
  "title": "League of Legends Side Analysis",
  "year": 2024,
  "image": "https://vis-society.github.io/labs/2/images/empty.svg",
  "description": "Statistical analysis project examining game outcome correlation with team side positions, utilizing Pandas, NumPy, and Plotly for advanced data visualization and statistical techniques."
  },
  {
  "title": "Datasaur Royale",
  "year": 2024,
  "image": "https://vis-society.github.io/labs/2/images/empty.svg",
  "description": "Award-winning hackathon project implementing genetic algorithms to optimize dinosaur survival traits in a custom simulation environment using PyGame and reinforcement learning techniques."
  },
  {
  "title": "Annotate It",
  "year": 2024,
  "image": "https://vis-society.github.io/labs/2/images/empty.svg",
  "description": "Enhanced image annotation tool featuring QOL improvements like autocomplete and rewind functionality, reducing labeling time by 75%. Built with Python and PyQt for efficient data labeling workflows."
  },
  {
  "title": "TCG Query System",
  "year": 2023,
  "image": "https://vis-society.github.io/labs/2/images/empty.svg",
  "description": "Advanced trading card game database query system with flexible search parameters and optimization for large dataset handling."
  },
  {
  "title": "Automated LeetCode",
  "year": 2023,
  "image": "https://vis-society.github.io/labs/2/images/empty.svg",
  "description": "LeetCode is hard, so I programmed doing it automatically (I know it defeats the purpose)."
  },
  {
  "title": "Capture The Flag Solutions",
  "year": 2023,
  "image": "https://vis-society.github.io/labs/2/images/empty.svg",
  "description": "Repository of cybersecurity challenge solutions and tools developed for various CTF competitions."
  },
  {
  "title": "Flexible Image Hashing",
  "year": 2022,
  "image": "https://vis-society.github.io/labs/2/images/empty.svg",
  "description": "Library of differnt image hasing algos, useful for finding image similarity mostly."
  },
  {
  "title": "Wikipedia Data Scraper",
  "year": 2022,
  "image": "https://vis-society.github.io/labs/2/images/empty.svg",
  "description": "Efficient web scraping tool specifically designed for extracting and processing Wikipedia article data."
  },
  {
  "title": "DataFrame SQL Engine",
  "year": 2021,
  "image": "https://vis-society.github.io/labs/2/images/empty.svg",
  "description": "Custom SQL operations implementation for DataFrame manipulation, bridging SQL and pandas functionality."
  },
  {
  "title": "Track Handler: DJ Library",
  "year": 2021,
  "image": "https://vis-society.github.io/labs/2/images/empty.svg",
  "description": "Custom DJ library for track management and organization, featuring advanced metadata extraction and search capabilities."
}
]